In [9]:
import pandas as pd

In [ ]:
pd.read_csv('')

When reading in a .csv, you do **pd.read_csv**. When exporting a dataframe to .csv, you do **df.to_csv** which makes sense considering there is a now a dataframe to call off of.

There are all sorts of other file types which can easily be imported from/exported to, and the syntax is easily found online. For instance, importing/exporting Google BigQuery data: 
**pd.read_gbq** and 
**df.to_gbq**

To figure out the current working directory of this notebook:

In [10]:
pwd

'C:\\Users\\User\\Data Science Workbooks\\Pandas'

The list of files in this environment can be found using </br></br> ls

In [12]:
ls

 Volume in drive C has no label.
 Volume Serial Number is FC29-7B0F

 Directory of C:\Users\User\Data Science Workbooks\Pandas

12/23/2022  12:33 PM    <DIR>          .
12/23/2022  12:33 PM    <DIR>          ..
12/23/2022  11:28 AM    <DIR>          .ipynb_checkpoints
12/23/2022  11:30 AM             5,352 df.unique().ipynb
12/18/2022  02:07 PM             2,366 Filepath Locator.ipynb
10/07/2022  12:33 PM             6,684 Pandas 1 Workbook.ipynb
11/15/2022  04:39 PM            27,527 Pandas Workbook 10 Date and Time Methods.ipynb
12/23/2022  12:33 PM             1,872 Pandas Workbook 11 CSV.ipynb
11/15/2022  08:50 PM            10,510 Pandas Workbook 12 Excel Files.ipynb
11/15/2022  05:42 PM            30,357 Pandas Workbook 12 HTML Tables.ipynb
11/16/2022  03:53 PM            12,913 Pandas Workbook 13 SQL Files.ipynb
11/16/2022  05:42 PM            87,892 Pandas Workbook 14 Pivot Tables.ipynb
11/16/2022  05:44 PM               589 Pandas Workbook 15 Pandas Section Excercise.ipynb
12/18/2022  02:24 PM            52,589 Pandas Workbook 16 Project Excercise Solution.ipynb
11/17/2022  04:04 PM            99,584 Pandas Workbook 16 Project Excercise.ipynb
10/08/2022  05:24 PM             5,870 Pandas Workbook 2 Series.ipynb
10/12/2022  01:38 PM           188,860 Pandas Workbook 3 Data Frames.ipynb
11/01/2022  01:07 PM           104,489 Pandas Workbook 4 Conditional Filtering.ipynb
10/19/2022  03:11 PM           115,039 Pandas Workbook 5 Useful Methods.ipynb
10/30/2022  06:00 PM            13,334 Pandas Workbook 6 Missing Data.ipynb
10/31/2022  02:00 PM           971,798 Pandas Workbook 7 Missing Data II.ipynb
11/02/2022  02:48 PM            87,154 Pandas Workbook 7 Missing Data III.ipynb
11/15/2022  03:32 PM            84,183 Pandas Workbook 8 Combining Dataframes Concatenation.ipynb
11/11/2022  02:28 PM             8,016 Pandas Workbook 8 Concatenation II Merging.ipynb
11/02/2022  04:06 PM             1,234 Pandas Workbook 9 Combining DataFrames Left and Right Merge.ipynb
11/15/2022  04:03 PM            13,917 Pandas Workbook 9 Text Methods for String Data.ipynb
              23 File(s)      1,932,129 bytes
               3 Dir(s)  122,325,045,248 bytes free

In [17]:
df = pd.read_csv(r'C:\Users\User\Desktop\Udemy Data Science Course Resources\DATA\example.csv')

NOTE: In this specific instance, I was not able to find example.csv in the directory, so I copied the file path. That innitially didn't work either, but adding an **r** outside of the quotes before the file path seems to have fixed the error.

In [18]:
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Pandas infers that **a, b, c, d** are supposed to be the header since they're a different data type (str). If this is not desired:

In [22]:
pd.read_csv(r'C:\Users\User\Desktop\Udemy Data Science Course Resources\DATA\example.csv', header = None)

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

The first row is now the header and the row with strings is treated like a row of data. That's not what I want though, so I didn't save it to df.

In [23]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Setting **'a'** as the index:

In [24]:
pd.read_csv(r'C:\Users\User\Desktop\Udemy Data Science Course Resources\DATA\example.csv', index_col = 0)

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

Now the header is **'b', 'c', 'd'** and the index starts with **'a'**

In [25]:
df.to_csv('C:\\Users\\User\\Data Science Workbooks\\Pandas\\newfile.csv')

I simply took the filepath specified by running **pwd** and tacked on my prefered file name, i.e. **newfile.csv**

It's also possible to just save it as **newfile.csv** and it'll be stored in the current working directory.

If for some reason, you don't want to save it with the index, for instance because it's just the default 0,1,2,3... you can do:

In [26]:
df.to_csv('newfile_without_index', index=False)

In [27]:
new = pd.read_csv('newfile_without_index')

In [28]:
new.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

This dataframe created without saving the index looks as intended. Compare this to the table saved while retaining the unneeded index:

In [29]:
new2 = pd.read_csv('newfile.csv')

In [30]:
new2.head()

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

Now I'd have to remove the first column:

In [36]:
new2 = new2.drop(new2.columns[0], axis = 1)

In [37]:
new2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15